#Специан Вариант1
print("Start code: ")
books = []
#создание словарей с книгами
dict1 = {"title":"Анна Каренина", "author":"Лев Толстой", "year":"1877"}
dict2 = {"title":"Великий Гэтсби", "author":"Фрэнсис Скотт Фицджеральд", "year":"1925"}
dict3 = {"title":"1984", "author":"Джордж Оруэлл", "year":"1949"}
dict4 = {"title":"Сто лет одиночества", "author":"Габриэль Гарсиа Маркес", "year":"1967"}
dict5 = {"title":"Гарри Поттер и философский камень", "author":"Джоан Роулинг", "year":"1997"}
#добовляем словари в список
books.append(dict1)
books.append(dict2)
books.append(dict3)
books.append(dict4)
books.append(dict5)
#переменная x для посчетов
x = 0
#с помощью цикла выводим красиво номер книги, название, автора, год
for dicts in books:
    x += 1
    print(f"------------------------------Книга {x}------------------------------")
    print(f"Название: {dicts['title']} | Автор: {dicts['author']}")
    print(f"------------------------------{dicts["year"]}------------------------------")
#еще один принт для пробела
    print()
#конец кода
print("End code.")
